clc, clear, close all;
%% 基本参数
% 浮子基本参数,后缀为f
m_f = 4866;                     % 质量，单位为kg
R_f = 1;                        % 底部半径，单位m
h_f1 = 3;                       % 圆柱部分高度,单位m
h_f2 = 0.8;                     % 圆锥部分高度，单位m

% 振子基本参数，后缀为v
m_v = 2433;                     % 质量，单位为kg

% 其他参数
w = 1.7152;                     % 入射波浪频率，单位为s-1
m_a = 1028.876;                 % 垂荡附加质量，单位kg
lamda_h = 683.4558;             % 垂荡兴波阻尼系数，单位N*s/m
f_d = 3640;                     % 垂荡激励力振幅，单位N
k1 = 80000;                     % 弹簧刚度，单位N/m
rho = 1025;                     % 海水的密度，单位kg/m^3
g = 9.8;                        % 重力加速度，单位m/s^2
h_s = 2.00;                     % 由第一问得到的静止时水线高度，单位m