close all; clc,clear;
% 防护服的基本参数
rho = [300.00; 862.00; 74.20; 1.18];    % 1,2,3,4层密度(kg/m^3)
c = [1377; 2100; 1726; 1005];           % 1,2,3,4层比热容(J/kg*oC)
k = [0.082; 0.370; 0.045; 0.028];       % 1,2,3,4层热传导率(W/m*oC)
d = [0.6; 6; 3.6; 6.4]./1000;           % 1,2,3,4层厚度(mm) 2,4层为未知待定
% 边值条件
u0 = 37;                                % 初始各层的温度
ue = 65;                                % 初始环境温度
k_e = 120.05;                           % 与环境的交换系数
k_s = 8.36;                             % 与人体的交换系数

% 划分网格数
tmax = 3600; 
dt = 0.5;
n = tmax/dt;                            % 划分时间段数
each = [60;600;360;500];                % 划分各层段数
m = sum(each);

% 下面用二分法求解最优厚度
dmax = 25/1000; dmin = 0.6/1000;        % 第二层的厚度范围
e = 1e-5;
while dmax - dmin > e
    d(2) = (dmax + dmin)/2;
    u = heat(tmax, n, each, rho, c, k, d, u0, ue, k_e, k_s);
    tmp1 = u(n+1,1:m+1);
    tmp2 = u(1:n+1,m+1);
    if (tmp1(1,m+1) > 47) || (sum(tmp2>44)/2 > 300)
        dmin = d(2);
    else 
        dmax = d(2);
    end
end
fprintf('结果是：%.6f',(dmax + dmin)/2);

